#pragma once
// VT / KVM / DMA 为了提高内存和 CPU 之间通信的效率
// VT 虚拟化调试 -> 一台电脑能运行多个系统
// KVM 变成了双机外挂 -> 让多个系统能接管 CPU (因为有的软件要有 R0 权限) VMWare 早期没有 VT 技术没有 R0 权限 或者只能通过 API 模拟
// DMA 变成了无视任何保护直接读取内存 -> FPS 游戏

// 一个月 3w 的人 用人成本 6w 社保 + 软件

// --------------------------------------------
// 写代码
// 
// 前端
// 1000 个题

// 后端

// 测试

// 运维

// 游戏客户端 UI
//  1. Unity
//  2. Godot
//  3. Unreal
// --------------------------------------------
// 偏文科

// 游戏策划 -> 小公司
//  1. 怎么策划一个活动提高用户留存
//  2. 前期和后期的数值怎么让难度平滑
//  3. 游戏到后期很容易出现没东西玩的问题, 怎么解决

// --------------------------------------------
// 美术

// 技术美术 -> Shader 图形学(美学上的数学)
//  1. 程序化生成模型 -> 代替美术 / 一个 TA 能代替 8 个低端美工 + 1 个高级
//  2. 特效 VFX

// 地编 关卡设计和编辑 打光

// UI 设计

// --------------------------------------------
// 逆向

// IDA CE x64 OD SPY Shark 内核驱动 WinDBG DebugView
// 汇编 heap stack 堆和栈 加深了对系统的理解 (是因为我系统没怎么学)
// 计算机科学的人很熟悉 windows 开发和 c++

// 网络安全 | CTF 网络安全比赛 | 黑客比赛
// 1. 小工具 | 游戏网络发包
// 2. 加密 VMP | 游戏加壳 脱壳技术
// 3. Web 加密与解密 | 网站的外挂 4399 游戏的外挂
// 4. PWM 二进制逆向 | 写外挂以及怎么反外挂
// 5. Exe PE 文件, windows api 攻防 hook 反 hook 反注入

// 网络安全 杭州电子科技大学 211 级别 计算机科学 370
// 数学 150 英语 150 计算机 100 政治 100
// 网络安全 310 - 计算机科学 370
// 985 变成二本

// --------------------------------------------
// 汇编和驱动开发 岗位: Linux 内核开发 / Windows 内核开发